app/controllers/login_controller.rb

    def home
        if session[:user_id]
        @current_user = User.find(session[:user_id])
        end
        @allusers = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users"

    def confirm
        @usernew = User.new(first_name: params['user']['first_name'], last_name: params['user']['last_name'], email: params['user']['email'], password: params['user']['password'])
        name_email = params['user']['email']

        if !params['user']['first_name'].present?
            redirect_to '/login/blank'
        elsif !params['user']['last_name'].present?
            redirect_to '/login/blank'
        elsif !params['user']['email'].present?
            redirect_to '/login/blank'
        elsif !params['user']['password'].present?
            redirect_to '/login/blank'
        elsif !User.find_by_email(:"#{name_email}").nil?
            redirect_to '/login/email'
        else
            @usernew.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "@name_email"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ospital.thierry@neuf.fr"], ["LIMIT", 1]]
INSERT INTO "users" ("first_name", "last_name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def check
        @current_user = User.where(email: params['/login/login']['email'], password: params['/login/login']['password']).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["email", "aaaa"], ["password", "aaaa"], ["LIMIT", 1]]